import {Film} from '../types/film';

export const films: Film[] = [
  {
    id: '0000001',
    poster: 'img/fantastic-beasts-the-crimes-of-grindelwald.jpg',
    name: 'Fantastic Beasts: The Crimes of Grindelwald',
    description: 'Могущественный тёмный волшебник Геллерт Грин-де-Вальд пойман в Штатах, но не собирается молча сидеть в темнице и устраивает грандиозный побег. Теперь ничто не помешает ему добиться своей цели — установить превосходство волшебников над всеми немагическими существами на планете. Чтобы сорвать планы Грин-де-Вальда, Альбус Дамблдор обращается к своему бывшему студенту Ньюту Саламандеру, который соглашается помочь, не подозревая, какая опасность ему грозит. В раскалывающемся на части волшебном мире любовь и верность проверяются на прочность, а конфликт разделяет даже настоящих друзей и членов семей.',
    releaseYear: 2018,
    ratingCount: 279604,
    starring: [
      'Эдди Редмэйн',
      'Джонни Депп',
      'Кэтрин Уотерстон',
      'Элисон Судол',
      'Дэн Фоглер',
      'Джуд Лоу',
      'Эзра Миллер',
      'Зои Кравиц',
      'Каллум Тернер',
      'Клаудия Ким'
    ],
    directors: ['Дэвид Йейтс'],
    genres: ['фэнтези', 'приключения', 'семейный'],
    rating: 6.7,
    source: 'https://download.blender.org/durian/trailer/sintel_trailer-480p.mp4'
  },
  {
    id: '0000002',
    poster: 'img/bohemian-rhapsody.jpg',
    name: 'Bohemian Rhapsody',
    description: 'Чествование группы Queen, их музыки и их выдающегося вокалиста Фредди Меркьюри, который бросил вызов стереотипам и победил условности, чтобы стать одним из самых любимых артистов на планете. Фильм прослеживает головокружительный путь группы к успеху благодаря их культовым песням и революционному звуку, практически распад коллектива, поскольку образ жизни Меркьюри выходит из-под контроля, и их триумфальное воссоединение накануне концерта Live Aid, ставшим одним из величайших выступлений в истории рок-музыки.',
    releaseYear: 2018,
    ratingCount: 533895,
    starring: [
      'Рами Малек',
      'Люси Бойнтон',
      'Гвилим Ли',
      'Бен Харди',
      'Джозеф Маццелло',
      'Эйдан Гиллен',
      'Аллен Лич',
      'Том Холландер',
      'Майк Майерс',
      'Аарон МакКаскер'
    ],
    directors: ['Брайан Сингер'],
    genres: ['биография', 'музыка', 'драма'],
    rating: 8.0,
    source: 'https://download.blender.org/durian/trailer/sintel_trailer-480p.mp4'
  },
  {
    id: '0000003',
    poster: 'img/macbeth.jpg',
    name: 'Macbeth',
    description: 'Холодные поля Шотландии, военный лагерь, всегда готовый переместиться в другое место. Макбет всегда на войне, его жена, недавно потерявшая ребенка, боится потерять еще и мужа. Чтобы удержать его рядом, она начинает свой проект по устранению конкурентов в борьбе за королевскую корону.',
    releaseYear: 2015,
    ratingCount: 57041,
    starring: [
      'Майкл Фассбендер',
      'Марион Котийяр',
      'Пэдди Консидайн',
      'Шон Харрис',
      'Джек Рейнор',
      'Элизабет Дебики',
      'Дэвид Тьюлис',
      'Росс Андерсон',
      'Дэвид Хейман',
      'Морис Роевз'
    ],
    directors: ['Джастин Курзель'],
    genres: ['драма', 'история', 'военный'],
    rating: 7.1,
    source: 'https://download.blender.org/durian/trailer/sintel_trailer-480p.mp4'
  },
  {
    id: '0000004',
    poster: 'img/aviator.jpg',
    name: 'Aviator',
    description: 'Получив от отца небольшую фабрику, Говард Хьюз превратил ее в гигантское, фантастически прибыльное предприятие. Став владельцем огромной кинокомпании, он снял самый дорогой для своего времени фильм и покорил сердца прелестнейших голливудских актрис.\n' +
      '\n' +
      'Ему принадлежали самые престижные казино Лас-Вегаса и он установил рекорд скоростных полетов, приобрел вторую по величине коммерческую авиакомпанию…\n' +
      '\n' +
      'Деньги жгут сердце Хьюза, они не дают ему покоя, а душа его рвется ввысь. Только там, на высоте нескольких тысяч метров он счастлив по-настоящему. Только там, где все решает лишь мастерство пилота и Бог, ничто не ценится так дорого, как верность и честь.',
    releaseYear: 2004,
    ratingCount: 360877,
    starring: [
      'Леонардо ДиКаприо',
      'Кейт Бланшетт',
      'Мэтт Росс',
      'Джон Си Райли',
      'Алан Алда',
      'Кейт Бекинсейл',
      'Алек Болдуин',
      'Иэн Холм',
      'Адам Скотт',
      'Дэнни Хьюстон'
    ],
    directors: ['Мартин Скорсезе'],
    genres: ['драма', 'биография'],
    rating: 7.6,
    source: 'https://download.blender.org/durian/trailer/sintel_trailer-480p.mp4'
  },
  {
    id: '0000005',
    poster: 'img/we-need-to-talk-about-kevin.jpg',
    name: 'We need to talk about Kevin',
    description: 'Отложив в сторону все личные и профессиональные амбиции, Ева посвящает жизнь рождению и воспитанию сына. Однако их отношения с самого начала оказываются крайне сложными. В пятнадцать лет Кевин совершает непоправимое, и Ева мучается сознанием ответственности и собственной вины. Достаточно ли она любила своего сына? Какова доля ее вины в происшедшем?',
    releaseYear: 2010,
    ratingCount: 155199,
    starring: [
      'Тильда Суинтон',
      'Джон Си Райли',
      'Эзра Миллер',
      'Джаспер Ньюэлл',
      'Рок Дер',
      'Эшли Герасимович',
      'Шиван Фэллон',
      'Алекс Манетт',
      'Кеннет Франклин',
      'Лесли Лайлс'
    ],
    directors: ['Линн Рэмси'],
    genres: ['триллер', 'драма', 'детектив'],
    rating: 7.2,
    source: 'https://download.blender.org/durian/trailer/sintel_trailer-480p.mp4'
  },
  {
    id: '0000006',
    poster: 'img/what-we-do-in-the-shadows.jpg',
    name: 'What We Do in the Shadows',
    description: 'История жизни Виаго, Дикона и Владислава — трёх соседей и по совместительству бессмертных вампиров, которые всего лишь пытаются выжить в современном мире, где есть арендная плата, фейсконтроль в ночных клубах, губительный солнечный свет и другие неприятности.',
    releaseYear: 2014,
    ratingCount: 183682,
    starring: [
      'Джемейн Клемент',
      'Тайка Вайтити',
      'Джонатан Бруг',
      'Кори Гонсалес-Макуэр',
      'Стью Рутерфорд',
      'Бен Френшам',
      'Джеки ван Бик',
      'Елена Стейко',
      'Джейсон Хойте',
      'Карен О’Лири'
    ],
    directors: ['Джемейн Клемент', 'Тайка Вайтити'],
    genres: ['комедия', 'ужасы'],
    rating: 7.5,
    source: 'https://download.blender.org/durian/trailer/sintel_trailer-480p.mp4'
  },
  {
    id: '0000007',
    poster: 'img/revenant.jpg',
    name: 'Revenant',
    description: 'Охотник Хью Гласс серьезно ранен на неизведанных просторах американского Дикого Запада. Товарищ Хью по отряду покорителей новых земель Джон Фицжеральд предательски оставляет его умирать в одиночестве. Теперь у Гласса осталось только одно оружие – его сила воли. Он готов бросить вызов первобытной природе, суровой зиме и враждебным племенам индейцев, только чтобы выжить и отомстить Фицжеральду.',
    releaseYear: 2015,
    ratingCount: 796406,
    starring: [
      'Леонардо ДиКаприо',
      'Том Харди',
      'Донал Глисон',
      'Уилл Поултер',
      'Форрест Гудлак',
      'Пол Андерсон',
      'Кристоффер Йонер',
      'Джошуа Бёрдж',
      'Дуан Ховард',
      'Мила Нахеко'
    ],
    directors: ['Алехандро Гонсалес Иньярриту'],
    genres: ['приключения', 'вестерн', 'боевик', 'драма', 'биография'],
    rating: 7.8,
    source: 'https://download.blender.org/durian/trailer/sintel_trailer-480p.mp4'
  },
  {
    id: '0000008',
    poster: 'img/johnny-english.jpg',
    name: 'Johnny English',
    description: 'История самого некомпетентного и недалекого Британского дипломата, которого только можно представить, которого ошибочно принимают за самого знаменитого и опасного шпиона Великобритании, Джонни Инглиша. Из-за этой путаницы герой оказывается вовлеченным в смертельную схватку с авторами очередного дьявольского плана.',
    releaseYear: 2003,
    ratingCount: 161255,
    starring: [
      'Роуэн Эткинсон',
      'Натали Имбрулья',
      'Бен Миллер',
      'Джон Малкович',
      'Тим Пиготт-Смит',
      'Кевин МакНэлли',
      'Оливер Форд Дейвис',
      'Дуглас МакФерран',
      'Таша ди Вашконселуш',
      'Грег Уайз'
    ],
    directors: ['Питер Хауит'],
    genres: ['боевик', 'комедия', 'приключения'],
    rating: 6.7,
    source: 'https://download.blender.org/durian/trailer/sintel_trailer-480p.mp4'
  }
];

